---
kind: method
id: M:Autodesk.Revit.DB.FormatOptions.#ctor
source: html/026c77fe-7121-d30d-f500-081e4360ee64.htm
---
# Autodesk.Revit.DB.FormatOptions.#ctor Method

Creates a new FormatOptions object that represents default formatting.

## Syntax (C#)
```csharp
public FormatOptions()
```